{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Напишите программу, вычисляющую следующее состояние поля для Game of life. \n",
    "\n",
    "Поле представляет собой прямоугольник, причём для крайних клеток поля соседними являются клетки с противоположного конца (поле представляет собой тор).\n",
    "\n",
    "Формат ввода:\n",
    "\n",
    "На первой строке указаны два целых числа через пробел -- высота и ширина поля.\n",
    "В следующих строках подаётся состояние поля. Точка \".\" обозначает мёртвую клетку, символ \"X\" - живую. \n",
    "\n",
    "Формат вывода:\n",
    "Следующее состояние поля, используя те же обозначения, что использовались на вводе.\n",
    "-----------------------------------------------------------------------------------\n",
    "Есть «вселенная», представленная в виде квадрата, разбитого на квадратные же поля. Поле может быть пустым, либо на нём может жить клетка. \n",
    "Каждый «день» игры рассчитывается новое поколение клеток по следующим правилам:\n",
    "\n",
    "на пустом поле, рядом с которым ровно 3 живые клетки, зарождается новая клетка;\n",
    "если у живой клетки есть 2 или 3 живые соседки, эта клетка продолжает жить;\n",
    "если соседей меньше 2 или больше 3, клетка умирает (от «одиночества» или от «перенаселённости» соответственно).\n",
    "\n",
    "Вселенная «тороидальная»: если зайти за её правый край, окажешься на левом, с верхом и низом то же самое.\n",
    "Для помощи: создавайте дополнительные столбцы и строки (нижний столбец добавить в 0 строку, а нулевой - к последнему, и со столбцами тоже самое)\n",
    "\"\"\"\n",
    "\n",
    "def split(s):                                       # split string on simbols in input()\n",
    "    return [char for char in s]\n",
    "\n",
    "def around_numbers(matrix, znak_tochka, i, j):      # функция для поиска соседей, обратите внимание на % \n",
    "    count = 0                                       # как круто эта фича решает проблему тороидального поля                 \n",
    "    if matrix[(i-1)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1    \n",
    "    if matrix[(i-1)%n][(j)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i-1)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i+1)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i+1)%n][j%m] == znak_tochka:\n",
    "        count += 1        \n",
    "    if matrix[(i+1)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    return count\n",
    "\n",
    "                        \n",
    "input_data = input().split()                        # first input\n",
    "n = int(input_data[0])\n",
    "m = int(input_data[1])\n",
    "     \n",
    "\n",
    "matrix= [split(input()) for i in range(n)]          # second input, generation game filed\n",
    "\n",
    "ZNAK_X = \"X\"\n",
    "\n",
    "matrix_copy = []\n",
    "\n",
    "\n",
    "for i in range(n):                                  # перебираем каждый элемент двумя циклами, первый построчно, второй поэлементно в строке\n",
    "    for j in range(m):                              # ищем соседей и выполняем условия заданные игрой\n",
    "        if matrix[i][j] == \".\":\n",
    "            count = around_numbers(matrix, ZNAK_X, i, j)\n",
    "            if count == 3:\n",
    "                matrix_copy.append('X')\n",
    "            else:\n",
    "                matrix_copy.append('.')\n",
    "\n",
    "        elif matrix[i][j] == \"X\":\n",
    "            count = around_numbers(matrix, ZNAK_X, i, j)\n",
    "            if (count == 2) or (count == 3):\n",
    "                matrix_copy.append('X')\n",
    "            elif (count < 2) or (count > 3):\n",
    "                matrix_copy.append('.')\n",
    "\n",
    "\n",
    "new_list = [matrix_copy[i:i+m] for i in range(0, len(matrix_copy), m)] # этот блок из списка делает снова вложенный список \n",
    "\n",
    "for i in new_list:                                                     # вывод на экран\n",
    "    for j in i:\n",
    "      print(j, end=\"\")\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['.', '.', '.', '.', '.', '.', '.', '.', '.', '.', '.', 'X', '.', 'X', '.', '.', '.', 'X', 'X', '.', '.', '.', 'X', '.', '.']\n",
      ".....\n",
      ".....\n",
      ".X.X.\n",
      "..XX.\n",
      "..X..\n"
     ]
    }
   ],
   "source": [
    "\"\"\"Test version\"\"\"\n",
    "\n",
    "n = 5\n",
    "m = 5\n",
    "\n",
    "matrix = [['.', '.', '.', '.', '.'],\n",
    "          ['.', '.', 'X', '.', '.'],\n",
    "          ['.', '.', '.', 'X', '.'],\n",
    "          ['.', 'X', 'X', 'X', '.'],\n",
    "          ['.', '.', '.', '.', '.'],\n",
    "         ]\n",
    "\n",
    "znak_tochka = \".\"\n",
    "ZNAK_X = \"X\"\n",
    "\n",
    "def around_numbers(matrix, znak_tochka, i, j):\n",
    "    count = 0\n",
    "    if matrix[(i-1)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1    \n",
    "    if matrix[(i-1)%n][(j)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i-1)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i+1)%n][(j-1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "    if matrix[(i+1)%n][j%m] == znak_tochka:\n",
    "        count += 1        \n",
    "    if matrix[(i+1)%n][(j+1)%m] == znak_tochka:\n",
    "        count += 1\n",
    "\n",
    "    return count\n",
    "\n",
    "matrix_copy = []\n",
    "\n",
    "for i in range(n):\n",
    "    for j in range(m):\n",
    "        if matrix[i][j] == \".\":\n",
    "            count = around_numbers(matrix, ZNAK_X, i, j)\n",
    "            if count == 3:\n",
    "                matrix_copy.append('X')\n",
    "            else:\n",
    "                matrix_copy.append('.')\n",
    "\n",
    "        elif matrix[i][j] == \"X\":\n",
    "            count = around_numbers(matrix, ZNAK_X, i, j)\n",
    "            if (count == 2) or (count == 3):\n",
    "                matrix_copy.append('X')\n",
    "            elif (count < 2) or (count > 3):\n",
    "                matrix_copy.append('.')\n",
    "\n",
    "\n",
    "\n",
    "print(matrix_copy)\n",
    "\n",
    "new_list = [matrix_copy[i:i+m] for i in range(0, len(matrix_copy), m)]\n",
    "\n",
    "for i in new_list:\n",
    "    for j in i:\n",
    "      print(j, end=\"\")\n",
    "    print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
