{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "turn 60\n",
      "turn -120\n",
      "turn 60\n",
      "turn 60\n",
      "turn 60\n",
      "turn -120\n",
      "turn 60\n",
      "turn -120\n",
      "turn 60\n",
      "turn -120\n",
      "turn 60\n",
      "turn 60\n",
      "turn 60\n",
      "turn -120\n",
      "turn 60\n"
     ]
    }
   ],
   "source": [
    "\"\"\"\n",
    "Кривая Коха -- это простой геометрический фрактал. \n",
    "\n",
    "Строится этот фрактал следующим образом: берётся отрезок, разделяется на три равных части. \n",
    "Вместо средней части вставляется два таких же отрезка, поставленные под углом 60 градусов друг к другу (см. иллюстрацию, переход от \n",
    "n=0 к n=1).\n",
    "Этот процесс повторяется на каждой итерации: каждый отрезок заменяется четырьмя.\n",
    "Напишите программу, которая принимает на вход число n \n",
    "количество итераций генерации кривой и выводит последовательность углов поворота при рисовании соответствующей линии от начальной точки к конечной, без отрыва пера.\n",
    "\n",
    "Способ проверки своего решения приведён на следующем степе.\n",
    "\n",
    "Формат ввода:\n",
    "Строка с целым числом n, 1≤n≤10.\n",
    "\n",
    "Формат вывода:\n",
    "\n",
    "Строки, содержащие последовательность поворотов. Каждый поворот указывается на отдельной строке как слово \"turn\" и угол поворота в градусах. \n",
    "Угол поворота должен находиться в интервале [-180; 180].\"\"\"\n",
    "\n",
    "while True:                                         # валидация данных\n",
    "    input_data = int(input())\n",
    "    if 1 <= input_data <= 10:\n",
    "        break\n",
    "    else:\n",
    "        continue\n",
    "\n",
    "def fractal(n):                                    # нихуя не понятно если честно, взял готовое решение для черепахи\n",
    "    turns = [60, -120, 60]                         # и переделал под свои задачи, собственное решение работало некоректно\n",
    "    if n == 1:\n",
    "        for i in turns:\n",
    "            print(f\"turn {i}\")\n",
    "        return\n",
    "    for i in turns:\n",
    "        fractal(n - 1)\n",
    "        print(f\"turn {i}\")\n",
    "    fractal(n - 1)\n",
    "\n",
    "fractal(input_data)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.6"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
